# При использовании образа "python:3.13" размер будет 1,79 Гб.
# При использовании "python:3.13-alpine" - 260 Мб.
# Решено сократить место, так как никаких посторонних библиотек не требуется. Это также ускоряет первую сборку.
FROM python:3.13-alpine

# В Python по умолчанию логи сначала складываются в буфер, а потом выводятся в консоль.
# В Docker это надо отключить, так как работает не работает корректно.
ENV PYTHONUNBUFFERED=1

# Каталог создаётся при необходимости. В любом случае после этой комнды будет выполнено переключения к этот каталог.
# Дальнешие комнды выполняются в этом каталоге.
WORKDIR /app

# Перед установкой зависимостей требуется установить poetry и рекомендуется обновить pip до актуальной версии.
# Версия poetry зафиксирована для совместимости при повторной сборке.
RUN pip install --upgrade pip "poetry==2.3.2"

# По умолчанию poetry создаёт виртуальное окружение. Это нужно отключить.
# --local - отключение только для текущего проекта
RUN poetry config virtualenvs.create false --local

# Копирование всех файлов poetry в текущую дирректирию - /app
COPY pyproject.toml poetry.lock ./

# --no-root - не пытаться установить текущие проект в режиме "пакета". Но искать структуру пакета. Иначе будет ошибка:
# Error: The current project could not be installed: No file/folder found for package mysite
RUN poetry install --no-root

# Копирование содержимого каталога "mysite" в текущий каталог "/app" рядом с ранее скопированными файлами.
# Сам каталог "mysite" не копируется. Копируется то, что в него вложено.
COPY mysite .

# Команда для запуска. Выполняется каждый раз (не кэшируется).

# РАЗРАБОТКА:
# Текущая команда запустит сервер на стандартном порте - 8000. ip - 127.0.0.1.
# С внешней машины доступа не будет. Поэтому запускать надо на "0.0.0.0:8080". Порт выбран произвольно.
# Аналогичный функционал есть в docker-compose, которые переопределяет эту команду (там - "приоритет").
# Поэтому команду решено сразу перенести туда. Рядом с настройкой проброса портов.
#CMD ["python", "manage.py", "runserver", "0.0.0.0:8080"]

# ПРОДУКТИВ:
# Для продуктива публикация на WSGI веб-сервере. Выполняется прослушивание всех запросов на порту "8000".
# Вторым параметров идёт адрес до переменной "application" из wsgi.py.
CMD ["gunicorn", "mysite.wsgi:application", "--bind", "0.0.0.0:8000"]